export const enum SearchLocales {
  Title = 'Давайте проверим 🔍',
  Subtitle = 'Введите модель оборудования, и мы расскажем, что с ней происходит.',

  InputPlaceholder = 'Начните вводить модель...',
  ResetSearchResults = 'Очистить и начать сначала 🔄',

  LetsSearchTitle = 'Давайте начнём поиск! 🪄',
  LetsSearchDescription = 'Осталось только ввести запрос, а дальше — дело техники и немного магии.',

  SearchResultsSomeTitle1 = 'Мы видим более',
  SearchResultsSomeTitle2 = 'вариантов!',
  SearchResultsSomeDescription = 'Попробуйте уточнить запрос, чтобы мы показали именно то, что нужно.',

  SearchResultsEmptyTitle = 'Разводим руками — такой модели пока нет.',
  SearchResultsEmptyDescription = 'Но это поправимо! Напишите в отдел СВН, и мы добавим её в каталог.',

  RelevantEquipment = 'Оборудование в строю — всё актуально!',

  ObsoleteEquipment = 'Оборудование устарело и больше не выпускается.',

  WatchOnOfficialSite = 'Посмотреть детали на официальном сайте 🌐',

  UnknownBrand = 'Бренд не указан 🤔',
  Brand = 'Бренд:',

  ReplacementNotFound = 'Замены, к сожалению, нет',

  SearchModel = 'Проверить модель 🔎',

  CopyModel = 'Скопировать название модели 📋'
}
