export const enum SearchLocales {
  Title = 'Давайте проверим',
  Subtitle = 'Введите название модели оборудования, чтобы узнать её статус, возможные аналоги, замены или перейти на сайт производителя.',

  InputPlaceholder = 'Начните вводить модель...',
  ResetSearchResults = 'Очистить и начать сначала 🔄',

  LetsSearchTitle = 'Начнём поиск! 🪄',
  LetsSearchDescription = 'Введите модель оборудования, и мы быстро найдём всю необходимую информацию.',

  SearchResultsSomeTitle1 = 'Мы нашли более',
  SearchResultsSomeTitle2 = 'результатов!',
  SearchResultsSomeDescription = 'Уточните запрос, чтобы мы могли показать модели, которые точно вам подойдут',

  SearchResultsEmptyTitle = 'Упс! Такой модели нет в каталоге.',
  SearchResultsEmptyDescription = 'Но это легко исправить! Сообщите об этом в отдел СВН',

  RelevantEquipment = 'Оборудование доступно для заказа',

  ObsoleteEquipment = 'Оборудование устарело и больше не выпускается',

  WatchOnOfficialSite = 'Посмотреть подробности на официальном сайте 🌐',

  UnknownBrand = 'Бренд не указан 🤔',
  Brand = 'Бренд:',

  ReplacementNotFound = 'Замены для этого оборудования нет',

  SearchModel = 'Проверить модель 🔎',

  CopyModel = 'Скопировать название модели 📋'
}
